qwazares/Gyroscope_STM_PC/STM32/Inc/gyroscope.h
#ifndef __GYROSCOPE_H
#define __GYROSCOPE_H

#include "stm32f4xx_hal.h"
#include <stdlib.h>

/******************************************************************************/
/*************************** REGISTER ADDRESS  ********************************/
/******************************************************************************/

#define L3GD20_WHO_AM_I_ADDR          0x0F  /* device identification register */
#define L3GD20_CTRL_REG1_ADDR         0x20  /* Control register 1 */
#define L3GD20_CTRL_REG2_ADDR         0x21  /* Control register 2 */
#define L3GD20_CTRL_REG3_ADDR         0x22  /* Control register 3 */
#define L3GD20_CTRL_REG4_ADDR         0x23  /* Control register 4 */
#define L3GD20_CTRL_REG5_ADDR         0x24  /* Control register 5 */
#define L3GD20_REFERENCE_REG_ADDR     0x25  /* Reference register */
#define L3GD20_OUT_TEMP_ADDR          0x26  /* Out temp register */
#define L3GD20_STATUS_REG_ADDR        0x27  /* Status register */
#define L3GD20_OUT_X_L_ADDR           0x28  /* Output Register X */
#define L3GD20_OUT_X_H_ADDR           0x29  /* Output Register X */
#define L3GD20_OUT_Y_L_ADDR           0x2A  /* Output Register Y */
#define L3GD20_OUT_Y_H_ADDR           0x2B  /* Output Register Y */
#define L3GD20_OUT_Z_L_ADDR           0x2C  /* Output Register Z */
#define L3GD20_OUT_Z_H_ADDR           0x2D  /* Output Register Z */
#define L3GD20_FIFO_CTRL_REG_ADDR     0x2E  /* Fifo control Register */
#define L3GD20_FIFO_SRC_REG_ADDR      0x2F  /* Fifo src Register */

#define L3GD20_INT1_CFG_ADDR          0x30  /* Interrupt 1 configuration Register */
#define L3GD20_INT1_SRC_ADDR          0x31  /* Interrupt 1 source Register */
#define L3GD20_INT1_TSH_XH_ADDR       0x32  /* Interrupt 1 Threshold X register */
#define L3GD20_INT1_TSH_XL_ADDR       0x33  /* Interrupt 1 Threshold X register */
#define L3GD20_INT1_TSH_YH_ADDR       0x34  /* Interrupt 1 Threshold Y register */
#define L3GD20_INT1_TSH_YL_ADDR       0x35  /* Interrupt 1 Threshold Y register */
#define L3GD20_INT1_TSH_ZH_ADDR       0x36  /* Interrupt 1 Threshold Z register */
#define L3GD20_INT1_TSH_ZL_ADDR       0x37  /* Interrupt 1 Threshold Z register */
#define L3GD20_INT1_DURATION_ADDR     0x38  /* Interrupt 1 DURATION register */


#define I_AM_L3GD20                 ((uint8_t)0xD4)		/* device ID */

/*********************** POWER MODE *******************************/
#define L3GD20_MODE_POWERDOWN       ((uint8_t)0x00)
#define L3GD20_MODE_ACTIVE          ((uint8_t)0x08)

/******************** OutPut DataRate *****************************/
#define L3GD20_OUTPUT_DATARATE_95     ((uint8_t)0x00)
#define L3GD20_OUTPUT_DATARATE_190    ((uint8_t)0x40)
#define L3GD20_OUTPUT_DATARATE_380    ((uint8_t)0x80)
#define L3GD20_OUTPUT_DATARATE_760    ((uint8_t)0xC0)

/**************************** Axes *******************************/
#define L3GD20_X_ENABLE            ((uint8_t)0x02)
#define L3GD20_Y_ENABLE            ((uint8_t)0x01)
#define L3GD20_Z_ENABLE            ((uint8_t)0x04)
#define L3GD20_AXES_ENABLE         ((uint8_t)0x07)
#define L3GD20_AXES_DISABLE        ((uint8_t)0x00)

/************************* Bandwidth *****************************/
#define L3GD20_BANDWIDTH_1         ((uint8_t)0x00)
#define L3GD20_BANDWIDTH_2         ((uint8_t)0x10)
#define L3GD20_BANDWIDTH_3         ((uint8_t)0x20)
#define L3GD20_BANDWIDTH_4         ((uint8_t)0x30)

/************************* Full Scale *****************************/
#define L3GD20_FULLSCALE_250       ((uint8_t)0x00)
#define L3GD20_FULLSCALE_500       ((uint8_t)0x10)
#define L3GD20_FULLSCALE_2000      ((uint8_t)0x20)
#define L3GD20_FULLSCALE_SELECTION ((uint8_t)0x30)

/******************** Full Scale Sensitivity **********************/
#define L3GD20_SENSITIVITY_250DPS  ((float)8.75f)         /*!< gyroscope sensitivity with 250 dps full scale [DPS/LSB]  */
#define L3GD20_SENSITIVITY_500DPS  ((float)17.50f)        /*!< gyroscope sensitivity with 500 dps full scale [DPS/LSB]  */
#define L3GD20_SENSITIVITY_2000DPS ((float)70.00f)        /*!< gyroscope sensitivity with 2000 dps full scale [DPS/LSB] */

/*********************** Block Data Update ************************/
#define L3GD20_BlockDataUpdate_Continous   ((uint8_t)0x00)
#define L3GD20_BlockDataUpdate_Single      ((uint8_t)0x80)

/************************** Endian Data ***************************/
#define L3GD20_BLE_LSB                     ((uint8_t)0x00)
#define L3GD20_BLE_MSB	                   ((uint8_t)0x40)

/******************** High Pass Filter status *********************/
#define L3GD20_HIGHPASSFILTER_DISABLE      ((uint8_t)0x00)
#define L3GD20_HIGHPASSFILTER_ENABLE	   ((uint8_t)0x10)

/********************** INT1 INT2 selection ***********************/
#define L3GD20_INT1                        ((uint8_t)0x00)
#define L3GD20_INT2                        ((uint8_t)0x01)

/********************* INT1 Interrupt status **********************/
#define L3GD20_INT1INTERRUPT_DISABLE       ((uint8_t)0x00)
#define L3GD20_INT1INTERRUPT_ENABLE        ((uint8_t)0x80)

/********************* INT2 Interrupt status **********************/
#define L3GD20_INT2INTERRUPT_DISABLE       ((uint8_t)0x00)
#define L3GD20_INT2INTERRUPT_ENABLE        ((uint8_t)0x08)

/********************* INT1 Interrupt ActiveEdge ******************/
#define L3GD20_INT1INTERRUPT_LOW_EDGE      ((uint8_t)0x20)
#define L3GD20_INT1INTERRUPT_HIGH_EDGE     ((uint8_t)0x00)

/*************************** Boot Mode ****************************/
#define L3GD20_BOOT_NORMALMODE             ((uint8_t)0x00)
#define L3GD20_BOOT_REBOOTMEMORY           ((uint8_t)0x80)

/********************* High Pass Filter Mode *********************/
#define L3GD20_HPM_NORMAL_MODE_RES         ((uint8_t)0x00)
#define L3GD20_HPM_REF_SIGNAL              ((uint8_t)0x10)
#define L3GD20_HPM_NORMAL_MODE             ((uint8_t)0x20)
#define L3GD20_HPM_AUTORESET_INT           ((uint8_t)0x30)

/********************* High Pass CUT-OFF Frequency *********************/
#define L3GD20_HPFCF_0              0x00
#define L3GD20_HPFCF_1              0x01
#define L3GD20_HPFCF_2              0x02
#define L3GD20_HPFCF_3              0x03
#define L3GD20_HPFCF_4              0x04
#define L3GD20_HPFCF_5              0x05
#define L3GD20_HPFCF_6              0x06
#define L3GD20_HPFCF_7              0x07
#define L3GD20_HPFCF_8              0x08
#define L3GD20_HPFCF_9              0x09

/*********************** READ WRITE ****************************/
#define L3GD20_WRITE              ((uint8_t)0x00)
#define L3GD20_READ               ((uint8_t)0x80)

#define L3GD20_MULTIPLE_RW        ((uint8_t)0x40)	//auto-incrementation of address
#define L3GD20_SINGLE_RW          ((uint8_t)0x00)

typedef struct
{
	SPI_HandleTypeDef *spi;
	GPIO_TypeDef *CS_Port;
	uint16_t CS_Pin;
	uint8_t power_mode;
	uint8_t axes;
	uint8_t output_datarate;
	uint8_t bandwidth;
	uint8_t full_scale;
	uint8_t block_data_update;
	uint8_t endian_data;
	uint8_t high_pass_filter_status;
	uint8_t high_pass_filter_mode;
	uint8_t high_pass_cutoff_frequency;
	uint8_t int1_status;
	uint8_t int2_status;
	uint8_t int1_active_edge;
	uint8_t boot_mode;

}L3GD20_Init_Struct;


typedef struct
{
	uint8_t out_x_l;
	uint8_t out_x_h;
	uint8_t out_y_l;
	uint8_t out_y_h;
	uint8_t out_z_l;
	uint8_t out_z_h;
}L3GD20_out_reg_axes;

typedef struct
{
	int16_t x_axis;
	int16_t y_axis;
	int16_t z_axis;
}Gyro_out_axes;


uint8_t L3GD20_Init(L3GD20_Init_Struct *Init);
uint8_t L3GD20_Read(uint8_t Address, uint8_t *data, uint16_t Size, L3GD20_Init_Struct *Gyro_Struct);
uint8_t L3GD20_Write(uint8_t Address, uint8_t *data, uint16_t Size, L3GD20_Init_Struct *Gyro_Struct);
uint8_t L3GD20_Read_Axes(L3GD20_out_reg_axes *Output, L3GD20_Init_Struct *Gyro_Struct);
uint8_t Gyro_Read_Axes(L3GD20_out_reg_axes *Input, Gyro_out_axes *Output, L3GD20_Init_Struct *Gyro_Struct);


#endif
